@echo off
echo                                     [ДОВІДКА]
echo _____________________________________________________________________________________________
echo KINOSTUDIA - Система управління базою даних.
echo CODEIT - консольний редактор, виступає програмною залежністю.
echo Може бути використаний як standalone-додаток. (описано нижче)
echo _____________________________________________________________________________________________
echo  * [Pre-build вимоги]:
echo 	    1) ОС Windows
echo 	    2) Visual Studio
echo             3) C++17
echo _______________________________________________________________________________________________
echo  * [Build]:
echo     Вітаю, ви на цьому кроці.
echo     Якщо ви впевнені, що всі необхідні компоненти встановлені - розпочинаєте побудову проєкту нижче.
echo _______________________________________________________________________________________________
echo  * [Post-build usage] (KINOSTUDIA) (optional):
echo    Запуск з рядковим командним аргументом -import (kinostudia) 	 
echo 	    I)  Переходимо в папку build
echo 	    II) Верхнє поле з вашим шляхом замінюємо на команду cmd.exe:
echo.
echo 	  _________________________________________________________      
echo 	 /C:\Users\repetovsky\cw-src\build -^> cmd.exe_____________/
echo.
echo 	    ІІІ) У терміналі вводимо kdb.exe -import
echo.
echo      _______________________________________________________
echo     ^|(c) Microsoft Corporation. All rights reserved.
echo     ^| C:\Users\repetovsky\cw-src\build kdb.exe -import
echo.
echo     IV)  Після запуску програми слідуємо вказівкам.
echo _____________________________________________________________________
echo  * Post-build usage (CODEIT) (optional):
echo 	1.Безпосередньо, як standalone клієнт -^> cmd.exe codeit.exe $шлях до файлу$.
echo     $ - шлях може бути відносним так і абсолютним
echo.
echo   __Відносний___________________________________________________
echo  /C:\Users\repetovskycw-src\codeit codeit.exe ./src/main.cpp___/
echo.
echo.
echo   __Абсолютний___________________________________________________    						
echo  /..\codeit codeit.exe С:/Users/repetovsky/Desktop/src/main.cpp_/
echo.
echo 	                                                       /
echo ______________________________________________________________/
echo main.cpp - демонстрація                                      /
echo ____________________________________________________________/
echo #include ^<iostream^>                                        /
echo.                                                          /
echo using namspace std;                                      /
echo.                                                        /
echo int main()                                             /
echo {                                                     /
echo    cout ^<^< "This cpp edited in codeit!" ^<^< endl;  /
echo    cin.get();                                       /
echo    return 0;	                                   /
echo }                                                 /
echo _____________________________________________________________________	    			  
echo _____________________________________________________________________
echo 	2.У базі даних kinostudia. 					  
echo 	 Головне меню -^> Розпочати робту з схемою -^> редактор codeit.
echo __________________________________________(c) kostenuksoft___________
echo _____________________________________________________________________